<h1>Some sample Data analysis code<h1>

In [2]:
import numpy as np

<p>Some generated values</p>

In [3]:
# Set the random seed to make the examples reproducible
np.random.seed(0)

In [4]:
# An array with a million parameters
m = np.random.randint(10, size=1000000)

def standard_double(array):
    output = np.empty(array.size)
    for i in range(array.size):
        output[i] = array[i] * 2
        
    return output

In [5]:
np.array([1,2,3]) + np.array([4,5,6])

array([5, 7, 9])

In [8]:
a3 = np.ones([1, 4])
a3

array([[1., 1., 1., 1.]])

In [12]:
np.arange(10).mean()

4.5

In [11]:
np.ones((4,4)).sum()

16.0

<h3>Some Pandas Code</h3>

In [14]:
import pandas as pd

In [16]:
s = pd.Series([1,2,3,4,5])
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [17]:
s[0]

1

In [18]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [20]:
paid = {
    "Louvre Museum": 5988065,
    "Orsay Museum": 1850092,
    "Pompidou Centre": 2620481,
    "National Natural History Museum": 404497
}

free = {
    "Louvre Museum": 4117897,
    "Orsay Museum": 1436132,
    "Pompidou Centre": 1070337,
    "National Natural History Museum": 344572
}

In [22]:
museum = pd.DataFrame({"paid": paid, "free": free})
museum

                                    paid     free
Louvre Museum                    5988065  4117897
Orsay Museum                     1850092  1436132
Pompidou Centre                  2620481  1070337
National Natural History Museum   404497   344572

In [25]:
museum["paid"]

Louvre Museum                      5988065
Orsay Museum                       1850092
Pompidou Centre                    2620481
National Natural History Museum     404497
Name: paid, dtype: int64

In [26]:
museum[museum["paid"] > 2000000]

                    paid     free
Louvre Museum    5988065  4117897
Pompidou Centre  2620481  1070337

In [28]:
museum["total"] = museum["free"] + museum["paid"]
museum

                                    paid     free     total
Louvre Museum                    5988065  4117897  10105962
Orsay Museum                     1850092  1436132   3286224
Pompidou Centre                  2620481  1070337   3690818
National Natural History Museum   404497   344572    749069

In [29]:
museum["total"].sum()

17832073

In [30]:
museum["total"].mean()

4458018.25

In [31]:
museums_alternate = pd.read_csv("./museums.csv")
museums_alternate

                              name     paid     free
0                    Louvre Museum  5988065  4117897
1                     Orsay Museum  1850092  1436132
2                  Pompidou Centre  2620481  1070337
3  National Natural History Museum   404497   344572

In [34]:
museum.to_csv("./museum_converted_to_csv.csv")

<h2>SciKit Learn for some ML</h2>